return {
    {
        category = "电力",
        items = {
            "铁制电线杆",
            "太阳能板I",
            "蓄电池I",
            "风力发电机I",
            "蒸汽发电机I",
            "锅炉I",
            "地热井I",
        }
    },
    {
        category = "物流",
        items = {
            "砖石公路-X型",
            "科研中心I",
            "采矿机I",
            "出货车站",
            "收货车站",
            "无人机仓库I", 
        },
    },
    {
        category = "加工",
        items = {
            "组装机I",
            "熔炼炉I",
            "粉碎机I",
        },
    },
    {
        category = "管道",
        items = {
            "管道1-X型",
            "地下管1-JI型",
            "液罐I",
            "烟囱I",
            "排水口I",
            "空气过滤器I",
            "核子挖掘机",
            "地下水挖掘机I",
        },
    },
    {
        category = "化工",
        items = {
            "电解厂I",
            "水电站I",
            "蒸馏厂I",
            "化工厂I",
        },
    },
    {
        category = "默认",
        items = {
            "铁制电线杆",
            "砖石公路-X型",
            "无人机仓库I", 
            "熔炼炉I",
            "组装机I",
            "采矿机I",
        },
    },
}