return {
    {
        category = "电力",
        items = {
            "风力发电机I",
            "太阳能板I",
            "轻型太阳能板",
            "蓄电池I",
            "蒸汽发电机I",
            "锅炉I",
            "地热井I",
            "轻型风力发电机",
        }
    },
    {
        category = "物流",
        items = {
            "采矿机I",
            "轻型采矿机",
            "仓库I",
            "无人机平台I",
            "科研中心I",
            "砖石公路-X型",
            "物流站",
            "停车站",
        },
    },
    {
        category = "加工",
        items = {
            "组装机I",
            "熔炼炉I",
            "粉碎机I",
        },
    },
    {
        category = "管道",
        items = {
            "管道1-X型",
            "地下管1-JI型",
            "液罐I",
            "烟囱I",
            "排水口I",
            "空气过滤器I",
            "地下水挖掘机I",
        },
    },
    {
        category = "化工",
        items = {
            "水电站I",
            "电解厂I",
            "蒸馏厂I",
            "化工厂I",
        },
    },
}