local help = {
	{
        name = "物品传送",
		content = {
            {"1. 传送物品只能发生在两个不同建筑之间"},
            {"2. 首先在发送物品建筑里选择“传送设置”"},
            {"3. 然后在接收物品建筑里选择“传送启动”"},
            {"4. 传送设置后在主界面正上方会出现可传送物品，点击该区域跳转到发送物品建筑"},
        },
        guide_progress = 5,
	},

	{
        name = "移动/删除",
		content = {
            {"1. 长按建筑达3秒激活建筑移动/删除"},
            {"2. 点击删除后建筑会立刻销毁"},
            {"3. 点击移动后滑动手指将建筑摆放到空置区域，点击“放置”后完成"},
        },
        guide_progress = 10,
	},

	{
        name = "电网铺设",
		content = {
            {"1. 导电建筑分为电线杆、无人机平台和发电建筑（风力发电机、太阳能板、蓄电池等）"},
            {"2. 每个导电建筑都一定的供电范围，点击导电建筑会显示浅蓝色的供电范围"},
            {"3. 如果连续的供电范围内至少含有一个发电建筑，则该范围组成电网"},
            {"4. 处于电网内的耗电建筑在供电充足时正常工作；在供电不足时低效工作；在无供电时停止工作"},
        },
        guide_progress = 15,
	},

}

return help