local entities = {
    {
        prototype_name = "指挥中心",
        dir = "N",
        items = {
	        {"铁板",200},
	        {"石砖",200},
	        {"采矿机I",4},
	        {"铸造厂I",1},
	        {"铸造厂I",1},
	        {"水电站I",1},
	        {"蒸馏厂I",2},
	        {"化工厂I",2},
	        {"破损水电站",2},
	        {"破损空气过滤器",3},
	        {"破损电解厂",1},
	        {"破损化工厂",6},
	        {"破损组装机",3},
	        {"破损铁制电线杆",10},
	        {"破损物流中心",4},
	        {"破损运输车辆",8},
	        {"破损车站",4},
        },
        x = 126,
        y = 126,
    },
}

return {
    entities = entities,
}