local entities = { {
    dir = "N",
    items = {},
    prototype_name = "指挥中心",
    recipe = "车辆装配",
    x = 126,
    y = 120
  }, {
    dir = "N",
    items = { { "收货车站", 2 }, { "送货车站", 2 }, { "铁制电线杆", 10 }, { "熔炼炉I", 2 }, { "无人机仓库", 5 }, { "水电站I", 2 } },
    prototype_name = "机身残骸",
    x = 107,
    y = 134
  }, {
    dir = "S",
    items = { { "无人机仓库", 4 }, { "采矿机I", 2 }, { "科研中心I", 1 }, { "组装机I", 4 } },
    prototype_name = "机尾残骸",
    x = 110,
    y = 120
  }, {
    dir = "S",
    items = { { "风力发电机I", 1 }, { "运输车框架", 4 }, { "太阳能板I", 6 }, { "蒸汽发电机I", 8 }, { "锅炉I", 4 }, { "蓄电池I", 10 } },
    prototype_name = "机翼残骸",
    x = 133,
    y = 122
  }, {
    dir = "W",
    items = { { "地下水挖掘机", 4 }, { "空气过滤器I", 4 }, { "化工厂I", 3 }, { "电解厂I", 1 } },
    prototype_name = "机头残骸",
    x = 125,
    y = 108
  } }
local road = {
  [31871] = 44,
  [31872] = 53,
  [31873] = 41,
  [32120] = 4,
  [32121] = 5,
  [32122] = 5,
  [32123] = 5,
  [32124] = 5,
  [32125] = 5,
  [32126] = 5,
  [32127] = 7,
  [32128] = 5,
  [32129] = 7,
  [32130] = 5,
  [32131] = 5,
  [32132] = 5,
  [32133] = 5,
  [32134] = 5,
  [32135] = 5,
  [32136] = 5,
  [32137] = 5,
  [32138] = 5,
  [32139] = 1
}

return {
    name = "测试路网",
    entities = entities,
    road = road,
}
    